Revit 2024 API
RebarRoundingManager.SegmentLengthRounding Property
 The rounding for shared parameters used by rebar.
Namespace: Autodesk.Revit.DB.Structure
Assembly: RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)
Since: 2014
Syntax
C#
public double SegmentLengthRounding { get; set; }
Visual Basic
Public Property SegmentLengthRounding As Double
	Get
	Set
Visual C++
public:
property double SegmentLengthRounding {
	double get ();
	void set (double value);
}
Remarks
 IsActiveOnElement property has to be true. SegmentLengthRounding is meaningless if IsActiveOnElement is false.
Exceptions
Exception | Condition
Autodesk.Revit.Exceptions.ArgumentException |  When setting this property: The given value for value is not a number
Autodesk.Revit.Exceptions.ArgumentOutOfRangeException |  When setting this property: The rounding value is not a positive value.
Autodesk.Revit.Exceptions.InvalidOperationException |  When setting this property: IsActiveOnElement property is false.
See Also
RebarRoundingManager Class
Autodesk.Revit.DB.Structure Namespace